from microbit import *
import music
display.show(Image.MUSIC_QUAVER)
tune = ["G4:2", "E4:2", "G4:2", "E4:2", "G4:2", "E4:2", "C4:4", "D4:2", "F4:2",
          "E4:2", "D4:2", "G4:4", "E1:4", "G4:2", "E4:2", "G4:2", "E4:2", "G4:2",
          "E4:2", "C4:4", "D4:2", "F4:2", "E4:2", "D4:2", "C4:4", "E1:4", "D4:2",
          "D4:2", "F4:2", "F4:2", "E4:2", "C4:2", "G4:4", "D4:2", "F4:2", "E4:2",
          "D4:2", "G4:4", "E1:4", "G4:2", "E4:2", "G4:2", "E4:2", "G4:2", "E4:2",
          "C4:4", "D4:2", "F4:2", "E4:2", "D4:2", "C4:4"]
music.play(tune)

'''
这节课学习使用micro:bit机器人来演奏乐曲《粉刷匠》。

import是导入，这里的意思是导入music库函数，并制作一个音符列表来创建一个旋律，
例如列表中G4:2表示以2为节拍播放G4音调，C4:4表示以4为节拍播放C4音调，后面的也是依次类推。
'''